In [14]:
import numpy as np
import pandas as pd

In [2]:
training_csv = 'train.csv'
test_csv = 'test.csv'

no_touch_train = pd.read_csv(training_csv)
no_touch_test = pd.read_csv(test_csv)

training_data = no_touch_train
testing_data = no_touch_test

training_data.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [3]:
testing_data.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [4]:
training_data['Name_title'] = training_data.Name.apply(lambda x: x.split(',')[1].split('.')[0].strip())
testing_data['Name_title'] = testing_data.Name.apply(lambda x: x.split(',')[1].split('.')[0].strip())

training_data['Title_num'] = training_data.Name.apply(lambda x: x.split(',')[1].split('.')[0].strip())
testing_data['Title_num'] = testing_data.Name.apply(lambda x: x.split(',')[1].split('.')[0].strip())

In [5]:
training_data['Title_num'] = training_data['Title_num'].replace('Mr',1)
training_data['Title_num'] = training_data['Title_num'].replace('Mrs',2)
training_data['Title_num'] = training_data['Title_num'].replace(['Miss','Mlle','Ms','Mme'],3)
training_data['Title_num'] = training_data['Title_num'].replace(['Major','Col','Capt'],4)
training_data['Title_num'] = training_data['Title_num'].replace(['Master','Don','Rev','Dr','Lady','Sir','the Countess','Jonkheer','Dona'],5)
# training_data.head(1)

testing_data['Title_num'] = testing_data['Title_num'].replace('Mr',1)
testing_data['Title_num'] = testing_data['Title_num'].replace('Mrs',2)
testing_data['Title_num'] = testing_data['Title_num'].replace(['Miss','Mlle','Ms','Mme'],3)
testing_data['Title_num'] = testing_data['Title_num'].replace(['Major','Col','Capt'],4)
testing_data['Title_num'] = testing_data['Title_num'].replace(['Master','Don','Rev','Dr','Lady','Sir','the Countess','Jonkheer','Dona'],5)
testing_data.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_title,Title_num
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,Mr,1

In [6]:
# making sex binary
training_data['Sex_binary'] = [0 if x == 'male' else 1 for x in training_data['Sex']]
# making sex binary
testing_data['Sex_binary'] = [0 if x == 'male' else 1 for x in testing_data['Sex']]

In [7]:
# adding age for mean and median
train_mean = training_data.Age.mean()
train_median = training_data.Age.median()

training_data["Age_imp_median"] = training_data.Age.fillna(train_median)
training_data["Age_imp_mean"] = training_data.Age.fillna(train_mean)

# adding age for mean and median
test_mean = testing_data.Age.mean()
test_median = testing_data.Age.median()

testing_data["Age_imp_median"] = testing_data.Age.fillna(test_median)
testing_data["Age_imp_mean"] = testing_data.Age.fillna(test_mean)

In [8]:
# cleaning cabin - moving to decks
training_data['Cabin_decks'] = training_data['Cabin'].str.replace('\d+','')
training_data['Cabin_decks'] = training_data['Cabin_decks'].replace(['NaN'],'N')

testing_data['Cabin_decks'] = testing_data['Cabin'].str.replace('\d+','')
testing_data['Cabin_decks'] = testing_data['Cabin_decks'].replace(['NaN'],'N')

In [9]:
training_data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_title,Title_num,Sex_binary,Age_imp_median,Age_imp_mean,Cabin_decks
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Mr,1,0,22.0,22.0,NaN

In [10]:
testing_data.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_title,Title_num,Sex_binary,Age_imp_median,Age_imp_mean,Cabin_decks
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,Mr,1,0,34.5,34.5,NaN

In [11]:
testing_data.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Name_title', 'Title_num',
       'Sex_binary', 'Age_imp_median', 'Age_imp_mean', 'Cabin_decks'],
      dtype='object')

In [17]:
corr = training_data.corr()
corr

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Title_num,Sex_binary,Age_imp_median,Age_imp_mean
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658,-0.031176,-0.042939,0.034212,0.033207
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,0.389249,0.543351,-0.064910,-0.069809
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,-0.090227,-0.131900,-0.339898,-0.331339
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,-0.323571,-0.093254,1.000000,1.000000
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,0.310486,0.114631,-0.233296,-0.232625
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,0.294096,0.245489,-0.172482,-0.179191
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,0.131456,0.182333,0.096688,0.091566
Title_num,-0.031176,0.389249,-0.090227,-0.323571,0.310486,0.294096,0.131456,1.000000,0.495367,-0.292857,-0.298120
Sex_binary,-0.042939,0.543351,-0.131900,-0.093254,0.114631,0.245489,0.182333,0.495367,1.000000,-0.081163,-0.084153
Age_imp_median,0.034212,-0.064910,-0.339898,1.000000,-0.233296,-0.172482,0.096688,-0.292857,-0.081163,1.000000,0.998642
Age_imp_mean,0.033207,-0.069809,-0.331339,1.000000,-0.232625,-0.179191,0.091566,-0.298120,-0.084153,0.998642,1.000000

In [18]:
X = pd.DataFrame(np.c_[training_data['Fare'],training_data['Title_num']], columns = ['Fare','Title_num'])
y = training_data['Survived']

In [21]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(X,y, test_size = .3, random_state=5)

In [22]:
from sklearn.linear_model import LinearRegression

model = LinearRegression()
model.fit(x_train, y_train)

LinearRegression()

In [26]:
predict = model.predict(x_test)

In [27]:
print('R-squared: %.4f' % model.score(x_test,y_test))

R-squared: 0.1970

In [ ]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X_train)

X_train = scaler.transform(X_train)
X_test = scaler.transform(X_test)

In [ ]:
from sklearn.neighbors import KNeighborsClassifier
classifier = KNeighborsClassifier(n_neighbors=5)
classifier.fit(X_train, y_train)